{"data":["0","3096","1487246811","CONTENT SHARED","-4029704725707465084","6013226412048763966","-6569695881431984742","Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/56.0.2924.87 Safari/537.36","SP","BR","HTML","http://www.cnbc.com/2016/12/21/former-google-career-coach-shares-a-useful-visual-trick.html","former google career coach shares a visual trick for figuring out what to do with your life","If you want 2017 to be an exciting year, design it that way. That's the advice of former Google career coach and job strategist Jenny Blake , who has helped more than a thousand people improve their work lives. She recommends creating a \"mind map,\" a visual diagram of your interests and goals. Drawing one doesn't take long and could help you figure out the next project, hobby or career change that will make the new year happier and more successful, Blake says. \"My favorite way to brainstorm creatively, whether it's about values or setting goals for the new year, is through mind maps,\" Blake tells CNBC. To make one, write down the year at the center of a piece of paper, and then draw spokes with different themes that are important to you. For example, your spokes could be business, personal life, health and fitness, fun, or skill building. From each of those themes, draw additional spokes to connect the themes to ways you want to improve or experiment in that area. Blake recommends you ask yourself: \"What's important to me about that? And what does success look like?\" For example, in \"personal life,\" you could write, \"Meet up with a friend at least once a month\" or \"Take a music class.\" The visual trick works because it helps you see the different ways you can improve, Blake writes in her book \" Pivot: The Only Move That Matters Is Your Next One .\" \"With mind mapping you are taking pen to paper, going old-school,\" Blake says. And if you're like many professionals who sit too much and stare too long at a computer, drawing might actually be fun. \"The goal is to break out of linear thinking,\" Blake says. \"Go broad. Go big. Go sideways, and then experiment to see which of your ideas is most likely to lead to a resonant next step.\" Video by Andrea Kramar.","en","433"],"status":"success"}
